book_store/app/controllers/books_controller.rb

  def index
    @books = Book.find(:all)
---
SELECT * FROM "books" WHERE ("books"."id" = 2)

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("isbn", "updated_at", "min_required", "title", "price", "publisher", "year", "catagory", "created_at") VALUES(12456, '2009-10-26 20:00:42', 9, 'Numerical Computation', 14.99, 'Frog Publishing', '1956', NULL, '2009-10-26 20:00:42')

  def edit
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

  def update
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

  def show
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 3) LIMIT 1