book_store/app/controllers/reviews_controller.rb

SELECT * FROM "books" WHERE ("books"."id" = 1)
SELECT * FROM "reviews" WHERE ("reviews"."book_id" IS NULL) LIMIT 1
---
  def index
    @book = Book.find(params[:book_id])
    @reviews = Review.find_all_by_book_id(params[:book_id]);

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def new
    @review = Review.new
    @book = Book.find(params[:book_id])

INSERT INTO "reviews" ("name", "updated_at", "review", "created_at", "book_id") VALUES('That was the worst. Seriously?', '2009-10-28 18:55:58', NULL, '2009-10-28 18:55:58', 1)
---
  def create
    @review = Review.new(params[:review])

    respond_to do |format|
      if @review.save