book_store/app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE ("users"."username" = 'admin') LIMIT 1
---
  def create
    @user = User.find_by_username(params[:user][:username])