book_store/app/controllers/store_controller.rb

  def add_to_cart
    book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 4)

  def remove_from_cart
    begin
      book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)