book_store/app/controllers/users_controller.rb

INSERT INTO "users" ("city", "credit_card_number", "updated_at", "zip", "username", "credit_card", "first_name", "password", "last_name", "address", "exp_date", "created_at", "state") VALUES('Columbus', 4545032323436061, '2009-11-16 05:26:12', 43201, 'admin', 'mastercard', 'tony', 'password', 'schneider', '1979 N 4th St.', '2000-01-01 00:00:00', '2009-11-16 05:26:12', 'OH')
---
  def create
    @user= User.new(params[:user])

    respond_to do |format|
      if @user.save